## Staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 3 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                      NAME                      |
|--------|------------------------------------------------|
| update | `aws_quicksight_data_set.jobs`                 |
|        | `aws_quicksight_data_set.services`             |
|        | `aws_quicksight_data_set.services_history`     |
| add    | `aws_quicksight_data_set.notification_history` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_quicksight_data_set.jobs will be updated in-place
  ~ resource "aws_quicksight_data_set" "jobs" {
        id             = "239043911459,jobs"
        name           = "Jobs"
        tags           = {}
        # (6 unchanged attributes hidden)



      ~ permissions {
          ~ principal = "arn:aws:quicksight:ca-central-1:239043911459:user/default/AWSReservedSSO_AWSAdministratorAccess_4085b2fdb6f29f43/stephen.astels@cds-snc.ca" -> "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-owners"
            # (1 unchanged attribute hidden)
        }
      - permissions {
          - actions   = [
              - "quicksight:CancelIngestion",
              - "quicksight:CreateIngestion",
              - "quicksight:DeleteDataSet",
              - "quicksight:DescribeDataSet",
              - "quicksight:DescribeDataSetPermissions",
              - "quicksight:DescribeIngestion",
              - "quicksight:ListIngestions",
              - "quicksight:PassDataSet",
              - "quicksight:UpdateDataSet",
              - "quicksight:UpdateDataSetPermissions",
            ] -> null
          - principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-owners" -> null
        }

        # (4 unchanged blocks hidden)
    }

  # aws_quicksight_data_set.notification_history will be created
  + resource "aws_quicksight_data_set" "notification_history" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "notification_history"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "Notification history"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + data_set_usage_configuration {
          + disable_use_as_direct_query_source = (known after apply)
          + disable_use_as_imported_source     = (known after apply)
        }

      + logical_table_map {
          + alias                = (known after apply)
          + logical_table_map_id = (known after apply)

          + data_transforms {
              + cast_column_type_operation {
                  + column_name     = (known after apply)
                  + format          = (known after apply)
                  + new_column_type = (known after apply)
                }

              + create_columns_operation {
                  + columns {
                      + column_id   = (known after apply)
                      + column_name = (known after apply)
                      + expression  = (known after apply)
                    }
                }

              + filter_operation {
                  + condition_expression = (known after apply)
                }

              + project_operation {
                  + projected_columns = (known after apply)
                }

              + rename_column_operation {
                  + column_name     = (known after apply)
                  + new_column_name = (known after apply)
                }

              + tag_column_operation {
                  + column_name = (known after apply)

                  + tags {
                      + column_geographic_role = (known after apply)

                      + column_description {
                          + text = (known after apply)
                        }
                    }
                }

              + untag_column_operation {
                  + column_name = (known after apply)
                  + tag_names   = (known after apply)
                }
            }

          + source {
              + data_set_arn      = (known after apply)
              + physical_table_id = (known after apply)

              + join_instruction {
                  + left_operand  = (known after apply)
                  + on_clause     = (known after apply)
                  + right_operand = (known after apply)
                  + type          = (known after apply)

                  + left_join_key_properties {
                      + unique_key = (known after apply)
                    }

                  + right_join_key_properties {
                      + unique_key = (known after apply)
                    }
                }
            }
        }

      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-viewers"
        }
      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-owners"
        }

      + physical_table_map {
          + physical_table_map_id = "notification-history"

          + relational_table {
              + data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging"
              + name            = "notification_history"

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_version"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "service_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "job_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_type"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_status"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "sent_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
            }

          + s3_source {
              + data_source_arn = (known after apply)

              + input_columns {
                  + name = (known after apply)
                  + type = (known after apply)
                }

              + upload_settings {
                  + contains_header = (known after apply)
                  + delimiter       = (known after apply)
                  + format          = (known after apply)
                  + start_from_row  = (known after apply)
                  + text_qualifier  = (known after apply)
                }
            }
        }
    }

  # aws_quicksight_data_set.services will be updated in-place
  ~ resource "aws_quicksight_data_set" "services" {
        id             = "239043911459,services"
        name           = "Services"
        tags           = {}
        # (6 unchanged attributes hidden)




      + physical_table_map {
          + physical_table_map_id = "services"

          + relational_table {
              + data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging"
              + name            = "services"

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "active"
                  + type = "BOOLEAN"
                }
              + input_columns {
                  + name = "count_as_live"
                  + type = "BOOLEAN"
                }
              + input_columns {
                  + name = "go_live_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "name"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "message_limit"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "rate_limit"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "sms_daily_limit"
                  + type = "INTEGER"
                }
            }

          + s3_source {
              + data_source_arn = (known after apply)

              + input_columns {
                  + name = (known after apply)
                  + type = (known after apply)
                }

              + upload_settings {
                  + contains_header = (known after apply)
                  + delimiter       = (known after apply)
                  + format          = (known after apply)
                  + start_from_row  = (known after apply)
                  + text_qualifier  = (known after apply)
                }
            }
        }
      - physical_table_map {
          - physical_table_map_id = "services" -> null

          - relational_table {
              - data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging" -> null
              - name            = "services" -> null

              - input_columns {
                  - name = "id" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "created_at" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "updated_at" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "active" -> null
                  - type = "BOOLEAN" -> null
                }
              - input_columns {
                  - name = "count_as_live" -> null
                  - type = "BOOLEAN" -> null
                }
              - input_columns {
                  - name = "go_live_at" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "name" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "message_limit" -> null
                  - type = "INTEGER" -> null
                }
              - input_columns {
                  - name = "rate_limit" -> null
                  - type = "INTEGER" -> null
                }
              - input_columns {
                  - name = "sms_limit" -> null
                  - type = "INTEGER" -> null
                }
            }
        }
        # (4 unchanged blocks hidden)
    }

  # aws_quicksight_data_set.services_history will be updated in-place
  ~ resource "aws_quicksight_data_set" "services_history" {
        id             = "239043911459,services_history"
        name           = "Services history"
        tags           = {}
        # (6 unchanged attributes hidden)




      + physical_table_map {
          + physical_table_map_id = "services-history"

          + relational_table {
              + data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging"
              + name            = "services_history"

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "version"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "active"
                  + type = "BOOLEAN"
                }
              + input_columns {
                  + name = "count_as_live"
                  + type = "BOOLEAN"
                }
              + input_columns {
                  + name = "go_live_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "name"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "message_limit"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "rate_limit"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "sms_daily_limit"
                  + type = "INTEGER"
                }
            }

          + s3_source {
              + data_source_arn = (known after apply)

              + input_columns {
                  + name = (known after apply)
                  + type = (known after apply)
                }

              + upload_settings {
                  + contains_header = (known after apply)
                  + delimiter       = (known after apply)
                  + format          = (known after apply)
                  + start_from_row  = (known after apply)
                  + text_qualifier  = (known after apply)
                }
            }
        }
      - physical_table_map {
          - physical_table_map_id = "services-history" -> null

          - relational_table {
              - data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging" -> null
              - name            = "services_history" -> null

              - input_columns {
                  - name = "id" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "version" -> null
                  - type = "INTEGER" -> null
                }
              - input_columns {
                  - name = "created_at" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "updated_at" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "active" -> null
                  - type = "BOOLEAN" -> null
                }
              - input_columns {
                  - name = "count_as_live" -> null
                  - type = "BOOLEAN" -> null
                }
              - input_columns {
                  - name = "go_live_at" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "name" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "message_limit" -> null
                  - type = "INTEGER" -> null
                }
              - input_columns {
                  - name = "rate_limit" -> null
                  - type = "INTEGER" -> null
                }
              - input_columns {
                  - name = "sms_limit" -> null
                  - type = "INTEGER" -> null
                }
            }
        }
        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notification_history"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services_history"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates_history"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]

32 tests, 17 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
